[
  {
    "idMeal": "53073",
    "strMeal": "Eggplant Adobo",
    "strMealAlternate": null,
    "strCategory": "Vegetarian",
    "strArea": "Filipino",
    "strInstructions": "1.\tSlice 1 lb. small Japanese or Italian eggplant (about 3) into quarters lengthwise, then cut crosswise into 2\"-wide pieces. Place in a medium bowl. Add 1 Tbsp. sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. freshly ground black pepper. Toss to evenly coat eggplant and let sit at room temperature at least 20 minutes and up to 2 hours.\r\n2.\tPeel and thinly slice 8 garlic cloves. Add 3 Tbsp. vegetable oil and half of garlic to a medium Dutch oven or other heavy pot. Cook over medium-high heat, stirring constantly with a wooden spoon, until light golden and crisp, about 5 minutes. Using a slotted spoon, transfer garlic chips to a plate; season lightly with salt.\r\n3. Place 4 oz. ground pork in same pot and break up into small pieces with wooden spoon. Season with ¼ tsp. Diamond Crystal or Morton kosher salt and cook, undisturbed, until deeply browned underneath, about 5 minutes. Using a slotted spoon, transfer to another plate, leaving fat behind in the pot.\r\n4. Place eggplant on a clean kitchen towel and blot away any moisture the salt has drawn out.\r\n5. Working in batches and adding more oil if needed, cook eggplant in the same pot until lightly browned, about 3 minutes per side. Transfer to a plate with pork.\r\n6. Pour 1½ cups of water into the pot and scrape up browned bits from the bottom with a wooden spoon. Add remaining garlic, 3 Tbsp. coconut vinegar or unseasoned rice vinegar, 2 Tbsp. soy sauce, 2 bay leaves, 1 tsp. freshly ground black pepper, and remaining 1 Tbsp. sugar. Bring to a simmer, then return pork and eggplant to pot. Reduce heat to medium-low, partially cover, and simmer until eggplant is tender and silky and sauce is reduced by half, 20–25 minutes. Taste and season with more salt and pepper and add a little more sugar if needed.\r\n7. Top with garlic chips and serve with cooked white rice.\r\n",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/y7h0lq1683208991.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=pKXACYjwMns",
    "strIngredient1": "Egg Plants",
    "strIngredient2": "Sugar",
    "strIngredient3": "Salt",
    "strIngredient4": "Pepper",
    "strIngredient5": "Garlic",
    "strIngredient6": "Olive Oil",
    "strIngredient7": "Ground Pork",
    "strIngredient8": "Rice Vinegar",
    "strIngredient9": "Soy Sauce",
    "strIngredient10": "Bay Leaf",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 lb",
    "strMeasure2": "2 tbs",
    "strMeasure3": "1 tsp ",
    "strMeasure4": "1 tsp ",
    "strMeasure5": "1 whole",
    "strMeasure6": "3 tbs",
    "strMeasure7": "4 oz ",
    "strMeasure8": "3 tbs",
    "strMeasure9": "2 tbs",
    "strMeasure10": "2",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://salu-salo.com/eggplant-adobo/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52816",
    "strMeal": "Roasted Eggplant With Tahini, Pine Nuts, and Lentils",
    "strMealAlternate": null,
    "strCategory": "Vegetarian",
    "strArea": "American",
    "strInstructions": "\r\nFor the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roasting eggplant. Meanwhile, heat 2 tablespoons olive oil in a medium saucepan over medium heat until shimmering. Add carrots, celery, and onion and cook, stirring, until softened but not browned, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add lentils, bay leaves, stock or water, and a pinch of salt. Bring to a simmer, cover with the lid partially ajar, and cook until lentils are tender, about 30 minutes. (Top up with water if lentils are at any point not fully submerged.) Remove lid, stir in vinegar, and reduce until lentils are moist but not soupy. Season to taste with salt and pepper, cover, and keep warm until ready to serve.\r\n\r\n2.\r\nFor the Eggplant: While lentils cook, cut each eggplant in half. Score flesh with the tip of a paring knife in a cross-hatch pattern at 1-inch intervals. Transfer to a foil-lined rimmed baking sheet, cut side up, and brush each eggplant half with 1 tablespoon oil, letting each brushstroke be fully absorbed before brushing with more. Season with salt and pepper. Place a rosemary sprig on top of each one. Transfer to oven and roast until completely tender and well charred, 25 to 35 minutes. Remove from oven and discard rosemary.\r\n\r\n3.\r\nTo Serve: Heat 2 tablespoons olive oil and pine nuts in a medium skillet set over medium heat. Cook, tossing nuts frequently, until golden brown and aromatic, about 4 minutes. Transfer to a bowl to halt cooking. Stir half of parsley and rosemary into lentils and transfer to a serving platter. Arrange eggplant halves on top. Spread a few tablespoons of tahini sauce over each eggplant half and sprinkle with pine nuts. Sprinkle with remaining parsley and rosemary, drizzle with additional olive oil, and serve.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ysqrus1487425681.jpg",
    "strTags": "Vegetarian,Pulse,Nutty",
    "strYoutube": "https://www.youtube.com/watch?v=HkywCtna9t0",
    "strIngredient1": "Olive Oil",
    "strIngredient2": "Carrots",
    "strIngredient3": "Celery",
    "strIngredient4": "Onion",
    "strIngredient5": "Garlic",
    "strIngredient6": "Brown Lentils",
    "strIngredient7": "Bay Leaves",
    "strIngredient8": "Water",
    "strIngredient9": "Salt",
    "strIngredient10": "Apple Cider Vinegar",
    "strIngredient11": "Pepper",
    "strIngredient12": "Egg Plants",
    "strIngredient13": "Rosemary",
    "strIngredient14": "Pine nuts",
    "strIngredient15": "Parsley",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 tablespoons",
    "strMeasure2": "2 small cut into chunks",
    "strMeasure3": "2 small stalks",
    "strMeasure4": "1 medium finely diced",
    "strMeasure5": "6 medium cloves sliced",
    "strMeasure6": "12 ounces (340g)",
    "strMeasure7": "2",
    "strMeasure8": "4 cups",
    "strMeasure9": "Pinch",
    "strMeasure10": "2 teaspoons (10ml)",
    "strMeasure11": "Pinch",
    "strMeasure12": "2 large",
    "strMeasure13": "4 sprigs",
    "strMeasure14": "1/4 cup ",
    "strMeasure15": "2 tablespoons",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "http://www.seriouseats.com/recipes/2016/03/roasted-eggplant-tahini-pine-nut-lentil-vegan-experience-recipe.html",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53031",
    "strMeal": "Egyptian Fatteh",
    "strMealAlternate": null,
    "strCategory": "Beef",
    "strArea": "Egyptian",
    "strInstructions": "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.\r\nThen add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.\r\nTo prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.\r\nTo prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.\r\nNow take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.\r\nTo prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.\r\nTo fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.\r\nSpoon this atop the rice and serve. Enjoy!",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=WLuOHkDE4A4",
    "strIngredient1": "Beef",
    "strIngredient2": "Onion",
    "strIngredient3": "Chicken Stock Cube",
    "strIngredient4": "Tomatoes",
    "strIngredient5": "Garlic Clove",
    "strIngredient6": "Tomato Puree",
    "strIngredient7": "Rice",
    "strIngredient8": "Noodles",
    "strIngredient9": "Butter",
    "strIngredient10": "Olive Oil",
    "strIngredient11": "Pita Bread",
    "strIngredient12": "Cumin",
    "strIngredient13": "White Wine Vinegar",
    "strIngredient14": "Salt",
    "strIngredient15": "Pepper",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1lb",
    "strMeasure2": "1",
    "strMeasure3": "1",
    "strMeasure4": "2",
    "strMeasure5": "4",
    "strMeasure6": "1 tbs",
    "strMeasure7": "2 cups ",
    "strMeasure8": "1/4 cup",
    "strMeasure9": "1/4 cup",
    "strMeasure10": "2 cups ",
    "strMeasure11": "1",
    "strMeasure12": "1 tbs",
    "strMeasure13": "3 tbs",
    "strMeasure14": "To taste",
    "strMeasure15": "To taste",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.food.com/recipe/egyptian-faatah-rice-meat-with-crispy-bread-on-bottom-194764",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53046",
    "strMeal": "Portuguese custard tarts",
    "strMealAlternate": null,
    "strCategory": "Dessert",
    "strArea": "Portuguese",
    "strInstructions": "STEP 1\r\nRoll the pastry\r\nMix the flour and icing sugar, and use this to dust the work surface. Roll the pastry out to make a 45 x 30cm rectangle. Roll up lengthways to create a long sausage shape.\r\n\r\nSTEP 2\r\nCutting pastry into rounds\r\nCut the pastry into 24 wheels, about 1-2cm thick.\r\n\r\nSTEP 3\r\nRoll out each pastry portion\r\nRoll each wheel lightly with the rolling pin to fit 2 x 12-hole non-stick fairy cake tins.\r\n\r\nSTEP 4\r\nPress pastry into the tin\r\nPress the pastry circles into the tins and mould into the tins to make thin cases. Chill until needed.\r\n\r\nSTEP 5\r\nMake the infused syrup\r\nHeat the oven to 220C/fan 200C/gas 7. Make a sugar syrup by bringing the sugar, 200ml water, lemon zest and cinnamon stick to the boil. Reduce until syrupy, allow to cool, then remove the cinnamon and lemon. Whisk the eggs, egg yolks and cornflour until smooth in another large pan.\r\n\r\nSTEP 6\r\nMaking custard\r\nHeat the milk and vanilla pod seeds in a separate pan until just below the boil. Gradually pour the hot milk over the eggs and cornflour, then cook on a low heat, continually whisking.\r\n\r\nSTEP 7\r\nAdd syrup to custard\r\nAdd the cooled sugar syrup to the custard and whisk until thickened slightly.\r\n\r\nSTEP 8\r\nPour custard into the tins\r\nPour the custard through a sieve. Pour into the pastry cases and bake for 15 minutes until the pastry is golden and the custard has darkened.\r\n\r\nSTEP 9\r\ncool and dust with icing sugar\r\nCool completely in the tins then sift over icing sugar and ground cinnamon to serve.\r\n\r\n\r\n\r\n ",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vmz7gl1614350221.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=lWLCxui1Mw8",
    "strIngredient1": "Plain Flour",
    "strIngredient2": "Icing Sugar",
    "strIngredient3": "Puff Pastry",
    "strIngredient4": "Caster Sugar",
    "strIngredient5": "Lemon Zest",
    "strIngredient6": "Cinnamon",
    "strIngredient7": "Eggs",
    "strIngredient8": "Egg Yolks",
    "strIngredient9": "Corn Flour",
    "strIngredient10": "Whole Milk",
    "strIngredient11": "Vanilla",
    "strIngredient12": "Cinnamon",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 tbs",
    "strMeasure2": "2 tbs",
    "strMeasure3": "375g",
    "strMeasure4": "250g",
    "strMeasure5": "2 strips",
    "strMeasure6": "1 Stick",
    "strMeasure7": "2",
    "strMeasure8": "4",
    "strMeasure9": "50g",
    "strMeasure10": "500ml",
    "strMeasure11": "Pod of",
    "strMeasure12": "To serve",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.olivemagazine.com/recipes/baking-and-desserts/portuguese-custard-tarts/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  }
]